import sqlite3

conn = sqlite3.connect("articles.db")
cursor = conn.cursor()

cursor.executemany('''
    INSERT INTO articles (title, content, author) VALUES (?, ?, ?)
''', [
    ("Таємниці космосу", "Цікаві факти про галактики та чорні діри", "Олег Мельник"),
    ("Як варити ідеальну каву", "Методи приготування ароматного напою", "Анна Коваленко"),
    ("Мистецтво мінімалізму", "Як спростити життя та позбутися зайвого", "Дмитро Савченко"),
    ("10 найкращих книг року", "Огляд популярних бестселерів", "Катерина Лисенко"),
    ("Подорожі без великих витрат", "Як економити на мандрівках і не втрачати вражень", "Сергій Романчук"),
    ("Чому корисно медитувати?", "Вплив медитації на здоров’я та свідомість", "Наталія Гриценко"),
    ("Найдивніші закони світу", "Дивовижні правові норми різних країн", "Андрій Поліщук")
])
conn.commit()

conn.close()
